#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # mongodbatlas_advanced_cluster.atlas-cluster will be created
  + resource "mongodbatlas_advanced_cluster" "atlas-cluster" {
      + advanced_configuration         = (known after apply)
      + backup_enabled                 = (known after apply)
      + cluster_id                     = (known after apply)
      + cluster_type                   = "REPLICASET"
      + connection_strings             = (known after apply)
      + create_date                    = (known after apply)
      + disk_size_gb                   = (known after apply)
      + encryption_at_rest_provider    = (known after apply)
      + id                             = (known after apply)
      + mongo_db_major_version         = (known after apply)
      + mongo_db_version               = (known after apply)
      + name                           = "tc-pedidos-cluster"
      + paused                         = (known after apply)
      + pit_enabled                    = (known after apply)
      + project_id                     = (known after apply)
      + root_cert_type                 = (known after apply)
      + state_name                     = (known after apply)
      + termination_protection_enabled = (known after apply)
      + version_release_system         = (known after apply)

      + replication_specs {
          + container_id = (known after apply)
          + id           = (known after apply)
          + num_shards   = 1
          + zone_name    = "ZoneName managed by Terraform"

          + region_configs {
              + backing_provider_name = "AWS"
              + priority              = 7
              + provider_name         = "TENANT"
              + region_name           = "US_EAST_1"

              + electable_specs {
                  + disk_iops     = (known after apply)
                  + instance_size = "M0"
                  + node_count    = 1
                }
            }
        }
    }

  # mongodbatlas_database_user.db-user will be created
  + resource "mongodbatlas_database_user" "db-user" {
      + auth_database_name = "admin"
      + aws_iam_type       = "NONE"
      + id                 = (known after apply)
      + ldap_auth_type     = "NONE"
      + oidc_auth_type     = "NONE"
      + password           = (sensitive value)
      + project_id         = (known after apply)
      + username           = (sensitive value)
      + x509_type          = "NONE"

      + roles {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # mongodbatlas_project.atlas-project will be created
  + resource "mongodbatlas_project" "atlas-project" {
      + cluster_count                                    = (known after apply)
      + created                                          = (known after apply)
      + id                                               = (known after apply)
      + ip_addresses                                     = (known after apply)
      + is_collect_database_specifics_statistics_enabled = (known after apply)
      + is_data_explorer_enabled                         = (known after apply)
      + is_extended_storage_sizes_enabled                = (known after apply)
      + is_performance_advisor_enabled                   = (known after apply)
      + is_realtime_performance_panel_enabled            = (known after apply)
      + is_schema_advisor_enabled                        = (known after apply)
      + name                                             = "tc-pedidos"
      + org_id                                           = "652c490caccf104e2a206620"
      + with_default_alerts_settings                     = true
    }

  # mongodbatlas_project_ip_access_list.ip will be created
  + resource "mongodbatlas_project_ip_access_list" "ip" {
      + aws_security_group = (known after apply)
      + cidr_block         = "0.0.0.0/0"
      + comment            = (known after apply)
      + id                 = (known after apply)
      + ip_address         = (known after apply)
      + project_id         = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + atlas_cluster_connection_string = (known after apply)
  + ip_access_list                  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @daniel-eiro, Action: `pull_request`*